In [1]:
#Datatypes
import   as pd
# Creating a series of car types
cars = pd.Series(["BMW", "Toyota", "Honda"])
cars

0       BMW
1    Toyota
2     Honda
dtype: object

In [2]:
import pandas as pd
# Creating a series of car types
cars = pd.Series(["BMW", "Toyota", "Honda"])
print(cars)

0       BMW
1    Toyota
2     Honda
dtype: object

In [3]:
# Creating a series of colours
colours = pd.Series(["Blue", "Red", "White"])
colours

0     Blue
1      Red
2    White
dtype: object

In [4]:
#You can create a DataFrame by using pd.DataFrame() and passing it a Python dictionary.
#Let's use our two Series as the values.
# Creating a DataFrame of cars and colours
car_data = pd.DataFrame({"Car type": cars, 
                         "Colour": colours})
print(car_data)

# Creating a series of colours
#colours1 = pd.Series(["green", "purple", "black"])
#colours

  Car type Colour
0      BMW   Blue
1   Toyota    Red
2    Honda  White

In [11]:
car_data = pd.DataFrame({"Car type": cars, 
                         "Colour": colours})
print(car_data)

  Car type Colour
0      BMW   Blue
1   Toyota    Red
2    Honda  White

In [5]:
#Dictionary- Dictionaries are used to store data values in key:value pairs.
thisdict ={"brand": "Ford","model": "Mustang","year": 1964}
print(thisdict)

{'brand': 'Ford', 'model': 'Mustang', 'year': 1964}

In [6]:
 #Make a Series of different foods
foods = pd.Series(["Almond butter", "Eggs", "Avocado"])

# Make a Series of different dollar values 
prices = pd.Series([9, 6, 2])

# Combine your Series of foods and dollar values into a DataFrame
food_data = pd.DataFrame({"Foods": foods,
                          "Price": prices})

food_data

           Foods  Price
0  Almond butter      9
1           Eggs      6
2        Avocado      2

In [11]:
# Import car sales data
car_sales = pd.read_csv("car-sales.csv") # takes a filename as string as input
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [12]:
car_sales =pd.read_csv("C:/Users/skuma/OneDrive/Desktop/python/car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [15]:
car_sales = pd.read_csv("car-sales.csv")
#car_sales['Make']
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [16]:
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [22]:
car_toyota=car_sales[car_sales["Make"] == "Toyota"]
car_toyota
car_toyota.to_csv('toyota.csv', index=False)
#The index=False argument tells pandas
#not to write row names (index) to the CSV file.

In [2]:
import pandas as pd

# Create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 35]}
df = pd.DataFrame(data)
df
# Save the DataFrame to a CSV file
df.to_csv('example.csv', index=False)

In [4]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [23]:
df = pd.read_csv("car-sales.csv")  
print(df.head(5))

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [27]:
df.loc[0]

Make                Toyota
Colour               White
Odometer (KM)       150043
Doors                    4
Price            $4,000.00
Name: 0, dtype: object

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [29]:
df.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [36]:
# Select cars with over 100,000 on the Odometer 
car_sales[car_sales["Odometer (KM)"] > 100000 and car_sales["Make"] == "Toyota"]
#car_sales[car_sales["Make"] == "Toyota"]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().